#pragma once

struct SBook
{
	char szAutor[30];
	char szTitle[30];
	int nYear;
	int nPagesNumber;
	double dPrice;
};

//------------------------------------------------------------------------------

/*Виводить у консоль книгу.
Приймає вказівник на книгу*/
int printBook(struct SBook* pBook);

//------------------------------------------------------------------------------

/*Перевіряє книги на збіжність.
Приймає вказівники на книги*/
int isBookEqual(struct SBook* pBook1, struct SBook* pBook2);

//------------------------------------------------------------------------------

/*Виводить книгу у файл.
Приймає вказівник на файловий потік та книгу*/
int saveToFile(FILE* pFile, const struct SBook book);

//------------------------------------------------------------------------------

/*Зчитує книгу з файл.
Приймає вказівник на файловий потік та вказівник на книгу*/
int loadFromFile(FILE* pFile, struct SBook* pBook);

//------------------------------------------------------------------------------

/*Зчитує книгу з консолі.
Приймає вказівник вказівник на книгу*/
void ConsoleInput(struct SBook* pBook);
