#pragma once
#include "Book.h"

struct SBookList
{
	struct SBook book;
	struct SBookList* pNext;
};

//------------------------------------------------------------------------------

/*Додає книгу на початок списку.
Приймає вказівник на головний елемент та книгу*/
int push_front(struct SBookList** ppHead, struct SBook book);

//------------------------------------------------------------------------------

/*Додає книгу на кінець списку.
Приймає вказівник на головний елемент та книгу*/
int push_back(struct SBookList** ppHead, struct SBook book);

//------------------------------------------------------------------------------

/*Додає книгу на початок списку та сортує його.
Приймає вказівник на головний елемент та книгу*/
int pushAndSort(struct SBookList** ppHead, struct SBook book);

//------------------------------------------------------------------------------


/*Вилучає книгу з початку списку.
Приймає вказівник на головний елемент*/
int pop_front(struct SBookList** ppHead);

//------------------------------------------------------------------------------

/*Вилучає книгу з кінця списку.
Приймає вказівник на головний елемент*/
int pop_back(struct SBookList** ppHead);

//------------------------------------------------------------------------------

/*Вилучає всі книги з списку ціна яких нижча за передану.
Приймає вказівник на головний елемент та ціну*/
int removeAllSmaller(struct SBookList** ppHead, double dPrice);

//------------------------------------------------------------------------------

/*Вилучає всі книги з списку.
Приймає вказівник на головний елемент*/
void clear(struct SBookList** ppHead);

//------------------------------------------------------------------------------

/*Сортує список за ціною у порядку зростання.
Приймає вказівник на головний елемент*/
int sortByPrice(struct SBookList** ppHead);

//------------------------------------------------------------------------------


/*Переставляє елементи місцями.
Приймає 2 вказівники на елементи списку*/
int swap(struct SBookList* pNode1, struct SBookList* pNode2);

//------------------------------------------------------------------------------

/*Повертає вказівник на знайдений елемент.
Приймає вказіник на головний елемент списку та вказівник на книгу*/
struct SBookList* find(struct SBookList* pHead, struct SBook* pBook);

//------------------------------------------------------------------------------

/*Повертає вказіник на структуру з знайденими елементам.
Приймає вказіник на головний елемент списку та літеру*/
struct SBookList* findAllByLetter(struct SBookList* pHead, char chLetter);

//------------------------------------------------------------------------------

/*Повертає середню ціну книг у списку.
Приймає вказіник на головний елемент списку*/
double findAvgPrice(struct SBookList* pHead);

//------------------------------------------------------------------------------

/*Виводить у консоль список книг.
Приймає вказівник на головний елемент*/
int printBookList(struct SBookList* pHead);

//------------------------------------------------------------------------------

/*Виводить у файл список книг.
Приймає вказіник на файловий потік та вказівник на головний елемент*/
int saveBooks(FILE* pFile, struct SBookList* pBooks);

//------------------------------------------------------------------------------

/*Зчитує з файлу список книг.
Приймає вказіник на файловий потік та вказівник на головний елемент*/
int loadBooks(FILE* pFile, struct SBookList** ppBooks);
